# Numpy

In [1]:
import pandas as pd
import numpy as np

{'empid': [112, 113, 114, 115], 'empname': ['aryan', 'ramu', 'santi', 'shyam'], 'empsal': [2000, 29999, 3000, 80000]}

In [2]:
data={
    "empid":[112,113,114,115],
    "empname":["aryan","ramu","santi","shyam"],
    "empsal":[2000,29999,3000,80000]
}

In [4]:
df=pd.DataFrame(data)
df

   empid empname  empsal
0    112   aryan    2000
1    113    ramu   29999
2    114   santi    3000
3    115   shyam   80000

In [5]:
#creating dataframe using .csv file
df2=pd.read_csv("insurance.csv")
df2.head()

,PatientID,age,gender,bmi,bloodpressure,diabetic,children,smoker,region,claim
0,1,39.0,male,23.2,91,Yes,0,No,southeast,1121.87
1,2,24.0,male,30.1,87,No,0,No,southeast,1131.51
2,3,NaN,male,33.3,82,Yes,0,No,southeast,1135.94
3,4,NaN,male,33.7,80,No,0,No,northwest,1136.40
4,5,NaN,male,34.1,100,No,0,No,northwest,1137.01

In [6]:
df2.head 
#selecting upper 5 lines

,PatientID,age,gender,bmi,bloodpressure,diabetic,children,smoker,region,claim
0,1,39.0,male,23.2,91,Yes,0,No,southeast,1121.87
1,2,24.0,male,30.1,87,No,0,No,southeast,1131.51
2,3,NaN,male,33.3,82,Yes,0,No,southeast,1135.94
3,4,NaN,male,33.7,80,No,0,No,northwest,1136.40
4,5,NaN,male,34.1,100,No,0,No,northwest,1137.01

In [7]:
df2.tail()
#selecting 5 lines form bottom

,PatientID,age,gender,bmi,bloodpressure,diabetic,children,smoker,region,claim
1335,1336,44.0,female,35.5,88,Yes,0,Yes,northwest,55135.40
1336,1337,59.0,female,38.1,120,No,1,Yes,northeast,58571.07
1337,1338,30.0,male,34.5,91,Yes,3,Yes,northwest,60021.40
1338,1339,37.0,male,30.4,106,No,0,Yes,southeast,62592.87
1339,1340,30.0,female,47.4,101,No,0,Yes,southeast,63770.43

In [11]:
df2.shape#number of rows and columns

(1340, 10)

In [10]:
df2.columns#columns

Index(['PatientID', 'age', 'gender', 'bmi', 'bloodpressure', 'diabetic',
       'children', 'smoker', 'region', 'claim'],
      dtype='str')

In [12]:
df2.info()#data type and null

<class 'pandas.DataFrame'>
RangeIndex: 1340 entries, 0 to 1339
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   PatientID      1340 non-null   int64
 1   age            1335 non-null   float64
 2   gender         1340 non-null   str
 3   bmi            1340 non-null   float64
 4   bloodpressure  1340 non-null   int64
 5   diabetic       1340 non-null   str
 6   children       1340 non-null   int64
 7   smoker         1340 non-null   str
 8   region         1337 non-null   str
 9   claim          1340 non-null   float64
dtypes: float64(3), int64(3), str(4)
memory usage: 104.8 KB

In [13]:
df2.describe()#stats for numeric colums

,PatientID,age,bmi,bloodpressure,children,claim
count,1340.000000,1335.000000,1340.000000,1340.000000,1340.000000,1340.000000
mean,670.500000,38.078652,30.668955,94.157463,1.093284,13252.745642
std,386.968991,11.102924,6.106735,11.434712,1.205334,12109.609288
min,1.000000,18.000000,16.000000,80.000000,0.000000,1121.870000
25%,335.750000,29.000000,26.275000,86.000000,0.000000,4719.685000
50%,670.500000,38.000000,30.400000,92.000000,1.000000,9369.615000
75%,1005.250000,47.000000,34.700000,99.000000,2.000000,16604.305000
max,1340.000000,60.000000,53.100000,140.000000,5.000000,63770.430000

In [15]:
df2["age"]
#used to select selected column

0       39.0
1       24.0
2        NaN
3        NaN
4        NaN
        ...
1335    44.0
1336    59.0
1337    30.0
1338    37.0
1339    30.0
Name: age, Length: 1340, dtype: float64

In [16]:
df2[["age","gender"]]
#selecting multiple column

       age  gender
0     39.0    male
1     24.0    male
2      NaN    male
3      NaN    male
4      NaN    male
...    ...     ...
1335  44.0  female
1336  59.0  female
1337  30.0    male
1338  37.0    male
1339  30.0  female

[1340 rows x 2 columns]

In [18]:
df2.head()[["age","gender","bmi"]]
#selecting multiple column from upper 5

    age gender   bmi
0  39.0   male  23.2
1  24.0   male  30.1
2   NaN   male  33.3
3   NaN   male  33.7
4   NaN   male  34.1

In [19]:
df2.loc[0]
#row 0 info "finding the infrormation of perticular row"

PatientID                1
age                   39.0
gender                male
bmi                   23.2
bloodpressure           91
diabetic               Yes
children                 0
smoker                  No
region           southeast
claim              1121.87
Name: 0, dtype: object

In [20]:
df2.iloc[0]#position based

PatientID                1
age                   39.0
gender                male
bmi                   23.2
bloodpressure           91
diabetic               Yes
children                 0
smoker                  No
region           southeast
claim              1121.87
Name: 0, dtype: object

In [21]:
df2.iloc[9]

PatientID               10
age                   30.0
gender                male
bmi                   53.1
bloodpressure           97
diabetic                No
children                 0
smoker                  No
region           northwest
claim              1163.46
Name: 9, dtype: object

In [23]:
print(df2.loc[0,"age"])

39.0

In [24]:
df2[df2["age"]>40]
#applying conditions

,PatientID,age,gender,bmi,bloodpressure,diabetic,children,smoker,region,claim
17,18,41.0,male,34.4,84,No,0,No,southwest,1261.86
18,19,49.0,male,35.4,97,Yes,0,No,southwest,1263.25
19,20,48.0,male,33.3,91,Yes,0,No,southeast,1391.53
20,21,45.0,male,23.2,85,Yes,0,No,southeast,1515.34
23,24,42.0,male,36.9,93,No,0,No,southeast,1534.30
...,...,...,...,...,...,...,...,...,...,...
1329,1330,52.0,female,37.7,109,Yes,0,Yes,southwest,48824.45
1333,1334,44.0,male,36.4,127,No,1,Yes,southwest,51194.56
1334,1335,43.0,male,32.8,125,No,0,Yes,southwest,52590.83
1335,1336,44.0,female,35.5,88,Yes,0,Yes,northwest,55135.40
1336,1337,59.0,female,38.1,120,No,1,Yes,northeast,58571.07

In [26]:
df2[df2["age"]==18]

,PatientID,age,gender,bmi,bloodpressure,diabetic,children,smoker,region,claim
22,23,18.0,male,35.5,100,Yes,0,No,southeast,1532.47
41,42,18.0,male,27.8,93,No,0,No,northwest,1635.73
152,153,18.0,male,27.6,94,Yes,0,No,northwest,2523.17
244,245,18.0,male,25.5,99,Yes,0,No,northeast,3645.09
259,260,18.0,male,30.9,92,No,2,No,northwest,3877.30
326,327,18.0,male,30.8,97,Yes,0,No,southwest,4646.76
462,463,18.0,male,29.8,97,No,2,No,southeast,6406.41
517,518,18.0,male,36.0,93,No,2,No,southeast,7160.33
564,565,18.0,male,26.6,95,No,1,No,southeast,7742.11
580,581,18.0,male,32.0,81,Yes,2,No,northwest,8116.27
632,633,18.0,male,32.3,98,Yes,1,No,northwest,8765.25
723,724,18.0,male,30.8,94,No,3,No,northeast,10141.14
818,819,18.0,male,43.7,101,No,1,No,southwest,11576.13
890,891,18.0,male,29.6,81,Yes,0,No,northeast,12731.00
1185,1186,18.0,male,29.7,103,No,2,No,northeast,32108.66
1331,1332,18.0,male,41.1,104,No,1,Yes,southeast,48970.25

In [27]:
df2[df2["age"]>50]#select * from insurance where age>50

,PatientID,age,gender,bmi,bloodpressure,diabetic,children,smoker,region,claim
28,29,58.0,female,31.1,87,No,0,No,southeast,1621.88
33,34,52.0,female,36.9,81,No,0,No,southeast,1629.83
62,63,51.0,female,18.6,98,Yes,0,No,southwest,1728.90
63,64,60.0,female,20.6,90,No,0,No,southwest,1731.68
65,66,51.0,female,28.9,87,Yes,0,No,southwest,1743.21
...,...,...,...,...,...,...,...,...,...,...
1305,1306,57.0,female,46.2,96,No,0,Yes,southeast,45863.21
1312,1313,56.0,female,36.9,110,No,3,Yes,northwest,46661.44
1325,1326,52.0,female,36.4,133,Yes,1,Yes,northeast,48517.56
1329,1330,52.0,female,37.7,109,Yes,0,Yes,southwest,48824.45
1336,1337,59.0,female,38.1,120,No,1,Yes,northeast,58571.07

In [34]:
df2[(df2["age"]>50)&(df2["gender"]=="female")]

,PatientID,age,gender,bmi,bloodpressure,diabetic,children,smoker,region,claim
28,29,58.0,female,31.1,87,No,0,No,southeast,1621.88
33,34,52.0,female,36.9,81,No,0,No,southeast,1629.83
62,63,51.0,female,18.6,98,Yes,0,No,southwest,1728.90
63,64,60.0,female,20.6,90,No,0,No,southwest,1731.68
65,66,51.0,female,28.9,87,Yes,0,No,southwest,1743.21
...,...,...,...,...,...,...,...,...,...,...
1305,1306,57.0,female,46.2,96,No,0,Yes,southeast,45863.21
1312,1313,56.0,female,36.9,110,No,3,Yes,northwest,46661.44
1325,1326,52.0,female,36.4,133,Yes,1,Yes,northeast,48517.56
1329,1330,52.0,female,37.7,109,Yes,0,Yes,southwest,48824.45
1336,1337,59.0,female,38.1,120,No,1,Yes,northeast,58571.07

In [37]:
df2["age_plus5"]=df2["age"]+5
df2.head()

,PatientID,age,gender,bmi,bloodpressure,diabetic,children,smoker,region,claim,age_plus5
0,1,39.0,male,23.2,91,Yes,0,No,southeast,1121.87,44.0
1,2,24.0,male,30.1,87,No,0,No,southeast,1131.51,29.0
2,3,NaN,male,33.3,82,Yes,0,No,southeast,1135.94,NaN
3,4,NaN,male,33.7,80,No,0,No,northwest,1136.40,NaN
4,5,NaN,male,34.1,100,No,0,No,northwest,1137.01,NaN

In [54]:
#task1=total number of rows and columns
rows,columns=df2.shape
print(rows)
print(columns)

1340
11

In [39]:
#task2=print column name of the dataset
df2.columns

Index(['PatientID', 'age', 'gender', 'bmi', 'bloodpressure', 'diabetic',
       'children', 'smoker', 'region', 'claim', 'age_plus5'],
      dtype='str')

In [40]:
#task3=data type of all column
df2.info()

<class 'pandas.DataFrame'>
RangeIndex: 1340 entries, 0 to 1339
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   PatientID      1340 non-null   int64
 1   age            1335 non-null   float64
 2   gender         1340 non-null   str
 3   bmi            1340 non-null   float64
 4   bloodpressure  1340 non-null   int64
 5   diabetic       1340 non-null   str
 6   children       1340 non-null   int64
 7   smoker         1340 non-null   str
 8   region         1337 non-null   str
 9   claim          1340 non-null   float64
 10  age_plus5      1335 non-null   float64
dtypes: float64(4), int64(3), str(4)
memory usage: 115.3 KB

In [52]:
#task4=count number of missing values in each column
df2.isnull().sum()

PatientID        0
age              5
gender           0
bmi              0
bloodpressure    0
diabetic         0
children         0
smoker           0
region           3
claim            0
age_plus5        5
dtype: int64

In [44]:
#task6=find average  bmi of patient
print(df2["bmi"].mean())

30.668955223880598

In [50]:
#task7=find min and max of insurance claim
print(df2["claim"].min())
print(df2["claim"].max())

1121.87
63770.43

In [56]:
#task5=replace missing values in age column with mean age 
df2["age"].fillna(df2["age"].mean(), inplace=True)

C:\Users\mrayu\AppData\Local\Temp\ipykernel_4292\3679987387.py:2: ChainedAssignmentError: A value is being set on a copy of a DataFrame or Series through chained assignment using an inplace method.
Such inplace method never works to update the original DataFrame or Series, because the intermediate object on which we are setting values always behaves as a copy (due to Copy-on-Write).

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' instead, to perform the operation inplace on the original object, or try to avoid an inplace operation using 'df[col] = df[col].method(value)'.

See the documentation for a more detailed explanation: https://pandas.pydata.org/pandas-docs/stable/user_guide/copy_on_write.html
  df2["age"].fillna(df2["age"].mean(),inplace=True)

0       39.000000
1       24.000000
2       38.078652
3       38.078652
4       38.078652
          ...
1335    44.000000
1336    59.000000
1337    30.000000
1338    37.000000
1339    30.000000
Name: age, Length: 1340, dtype: float64